/**
 任务名称：2689/ 基础服务-用户管理（react->vue）迁移
 开发人员：李建敏
 日期：2020-3月-24日
 任务类型：2.复制代码
 **/
export default {
  mobile: /^((\+|00)86)?1((3[\d])|(4[5679])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[\d])|(9[189]))\d{8}$/, // 严谨
  identityNumber: /^\d{6}(18|19|20)\d{2}(0\d|10|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$/,
  Number: /^\d+(\.{0,1}\d+){0,1}$/,
  intNumber: /^^([1-9]\d*|[0]{1,1})$/,
  email: /^[a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/,
  qq: /^[1-9][0-9]{4,10}$/,
  wechat: /^[a-zA-Z][-_a-zA-Z0-9]{5,19}$/,
  telephone: /^((((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\d{8})|((0\d{2}-\d{8}(-\d{1,4})?)|(0\d{3}-\d{7,8}(-\d{1,4})?)))$/,
  nameCode: /^[\u4e00-\u9fa5a-zA-Z0-9_]+$/,
  nickName: /^[\u4e00-\u9fa5a-zA-Z0-9]+$/,
  name: /^[\u4e00-\u9fa5a-zA-Z]+$/,
  password: /^[a-zA-Z]\w{6,17}$/,
  loginName: /^[A-Za-z0-9_]{6,20}$/,
  realName: /^(([a-zA-Z+.?·?a-zA-Z+]{2,30}$)|([\u4e00-\u9fa5+·?\u4e00-\u9fa5+]{2,50}$))/,
  unifiedSocialCreditCode: /^[0-9A-HJ-NPQRTUWXY]{2}\d{6}[0-9A-HJ-NPQRTUWXY]{10}$/,
  licensePlateNumber: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4,5}[A-HJ-NP-Z0-9挂学警港澳]$/
}
